# CategoryNameMap Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
CategoryNameMap Members
CategoryNameMap Class Constructors Methods Properties See Also
---
The CategoryNameMap type exposes the following members.
# Constructors
| Name | Description |
| --- | --- |
| --- | --- | --- |
| CategoryNameMap | Initializes a new instance of the CategoryNameMap class |

# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Clear | Removes every category from the map, rendering it empty. |
| Contains | Tests for the existence of a category with that name within the map. |
| Dispose | Causes the object to release immediately any resources it may be utilizing. (Inherited from APIObject.) |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| Erase | Removes a category with the specified name from the map. |
| ForwardIterator | Retrieve a forward moving iterator to the map. |
| GetEnumerator | Retrieve a forward moving iterator to the map. |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| Insert | Insert the specified category with the specified name into the map. |
| ReverseIterator | Retrieve a backward moving iterator to the map. |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsEmpty | Test to see if the map is empty. |
| IsReadOnly | Identifies if the object is read-only or modifiable. (Inherited from APIObject.) |
| Item | Gets or sets a category at a specified name within the map. |
| Size | Returns the number of categories that are in the map. |

# See Also
CategoryNameMap Class
Autodesk.Revit.DB Namespace